src/resurser/personsok-2021.1.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions name="PersonsokService"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:tns="http://statenspersonadressregister.se/personsok/2021.1"
                  xmlns:fraga="http://statenspersonadressregister.se/schema/personsok/2021.1/personsokningfraga"
                  xmlns:svar="http://statenspersonadressregister.se/schema/personsok/2021.1/personsokningsvar"
                  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  targetNamespace="http://statenspersonadressregister.se/personsok/2021.1">
    <wsdl:types>
        <xsd:schema targetNamespace="http://statenspersonadressregister.se/schema/personsok/2021.1/personsokningfraga">
            <xsd:include schemaLocation="http://xmls.statenspersonadressregister.se/se/spar/granssnitt/personsok/2021.1/PersonsokningFraga.xsd"/>
        </xsd:schema>
        <xsd:schema targetNamespace="http://statenspersonadressregister.se/schema/personsok/2021.1/personsokningsvar">
            <xsd:include schemaLocation="http://xmls.statenspersonadressregister.se/se/spar/granssnitt/personsok/2021.1/PersonsokningSvar.xsd"/>
        </xsd:schema>
    </wsdl:types>

    <wsdl:message name="PersonsokRequest">
        <wsdl:part element="fraga:SPARPersonsokningFraga" name="parameters"/>
    </wsdl:message>
    <wsdl:message name="PersonsokResponse">
        <wsdl:part element="svar:SPARPersonsokningSvar" name="parameters"/>
    </wsdl:message>

    <wsdl:portType name="PersonsokService">
        <wsdl:operation name="PersonSok">
            <wsdl:input message="tns:PersonsokRequest"/>
            <wsdl:output message="tns:PersonsokResponse"/>
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="PersonsokServiceSOAP" type="tns:PersonsokService">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="PersonSok">
            <soap:operation soapAction="http://skatteverket.se/spar/personsok/2021.1/PersonsokService/Personsok"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>

    <wsdl:service name="PersonsokService">
        <wsdl:port binding="tns:PersonsokServiceSOAP" name="PersonsokServiceSOAP">
            <soap:address location="http://localhost/personsok"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
